InDeviceMex/TM4C123/TM4C123_ApplicationLib/xDriver_MCU/DMA/Peripheral/Register/xHeader/DMA_RegisterPeripheralChannel.h
/**
 *
 * @file DMA_RegisterPeripheralChannel.h
 * @copyright
 * @verbatim InDeviceMex 2020 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 29 jul. 2020 @endverbatim
 *
 * @author
 * @verbatim vyldram @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date           Author     Version     Description
 * 29 jul. 2020     vyldram    1.0         initial Version@endverbatim
 */

#ifndef XDRIVER_MCU_DRIVER_HEADER_DMA_DMA_PERIPHERAL_DMA_REGISTER_DMA_REGISTERPERIPHERALCHANNEL_H_
#define XDRIVER_MCU_DRIVER_HEADER_DMA_DMA_PERIPHERAL_DMA_REGISTER_DMA_REGISTERPERIPHERALCHANNEL_H_

#include <xDriver_MCU/DMA/Peripheral/Register/xHeader/DMA_RegisterAddressChannel.h>
#include <xDriver_MCU/DMA/Peripheral/Struct/xHeader/DMA_StructPeripheralChannel.h>

#define DMACH    ((DMACH_TypeDef*) (DMACH_BASE))
#define DMAALTCH    ((DMACH_TypeDef*) (DMAALTCH_BASE))

/********************************************************************************************
************************************** 1 SRCENDP **********************************************
********************************************************************************************/
#define DMACH_SRCENDP0    ((DMASRCENDP_TypeDef*) (DMACH0_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP1    ((DMASRCENDP_TypeDef*) (DMACH1_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP2    ((DMASRCENDP_TypeDef*) (DMACH2_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP3    ((DMASRCENDP_TypeDef*) (DMACH3_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP4    ((DMASRCENDP_TypeDef*) (DMACH4_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP5    ((DMASRCENDP_TypeDef*) (DMACH5_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP6    ((DMASRCENDP_TypeDef*) (DMACH6_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP7    ((DMASRCENDP_TypeDef*) (DMACH7_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP8    ((DMASRCENDP_TypeDef*) (DMACH8_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP9    ((DMASRCENDP_TypeDef*) (DMACH9_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP10    ((DMASRCENDP_TypeDef*) (DMACH10_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP11    ((DMASRCENDP_TypeDef*) (DMACH11_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP12    ((DMASRCENDP_TypeDef*) (DMACH12_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP13    ((DMASRCENDP_TypeDef*) (DMACH13_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP14    ((DMASRCENDP_TypeDef*) (DMACH14_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP15    ((DMASRCENDP_TypeDef*) (DMACH15_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP16    ((DMASRCENDP_TypeDef*) (DMACH16_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP17    ((DMASRCENDP_TypeDef*) (DMACH17_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP18    ((DMASRCENDP_TypeDef*) (DMACH18_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP19    ((DMASRCENDP_TypeDef*) (DMACH19_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP20    ((DMASRCENDP_TypeDef*) (DMACH20_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP21    ((DMASRCENDP_TypeDef*) (DMACH21_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP22    ((DMASRCENDP_TypeDef*) (DMACH22_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP23    ((DMASRCENDP_TypeDef*) (DMACH23_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP24    ((DMASRCENDP_TypeDef*) (DMACH24_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP25    ((DMASRCENDP_TypeDef*) (DMACH25_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP26    ((DMASRCENDP_TypeDef*) (DMACH26_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP27    ((DMASRCENDP_TypeDef*) (DMACH27_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP28    ((DMASRCENDP_TypeDef*) (DMACH28_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP29    ((DMASRCENDP_TypeDef*) (DMACH29_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP30    ((DMASRCENDP_TypeDef*) (DMACH30_BASE + DMACH_SRCENDP_OFFSET))
#define DMACH_SRCENDP31    ((DMASRCENDP_TypeDef*) (DMACH31_BASE + DMACH_SRCENDP_OFFSET))

#define DMACH_SRCENDP0_R    (*((volatile uint32_t*) (DMACH0_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP1_R    (*((volatile uint32_t*) (DMACH1_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP2_R    (*((volatile uint32_t*) (DMACH2_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP3_R    (*((volatile uint32_t*) (DMACH3_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP4_R    (*((volatile uint32_t*) (DMACH4_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP5_R    (*((volatile uint32_t*) (DMACH5_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP6_R    (*((volatile uint32_t*) (DMACH6_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP7_R    (*((volatile uint32_t*) (DMACH7_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP8_R    (*((volatile uint32_t*) (DMACH8_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP9_R    (*((volatile uint32_t*) (DMACH9_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP10_R    (*((volatile uint32_t*) (DMACH10_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP11_R    (*((volatile uint32_t*) (DMACH11_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP12_R    (*((volatile uint32_t*) (DMACH12_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP13_R    (*((volatile uint32_t*) (DMACH13_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP14_R    (*((volatile uint32_t*) (DMACH14_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP15_R    (*((volatile uint32_t*) (DMACH15_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP16_R    (*((volatile uint32_t*) (DMACH16_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP17_R    (*((volatile uint32_t*) (DMACH17_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP18_R    (*((volatile uint32_t*) (DMACH18_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP19_R    (*((volatile uint32_t*) (DMACH19_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP20_R    (*((volatile uint32_t*) (DMACH20_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP21_R    (*((volatile uint32_t*) (DMACH21_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP22_R    (*((volatile uint32_t*) (DMACH22_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP23_R    (*((volatile uint32_t*) (DMACH23_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP24_R    (*((volatile uint32_t*) (DMACH24_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP25_R    (*((volatile uint32_t*) (DMACH25_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP26_R    (*((volatile uint32_t*) (DMACH26_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP27_R    (*((volatile uint32_t*) (DMACH27_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP28_R    (*((volatile uint32_t*) (DMACH28_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP29_R    (*((volatile uint32_t*) (DMACH29_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP30_R    (*((volatile uint32_t*) (DMACH30_BASE + DMACH_SRCENDP_OFFSET)))
#define DMACH_SRCENDP31_R    (*((volatile uint32_t*) (DMACH31_BASE + DMACH_SRCENDP_OFFSET)))

/********************************************************************************************
************************************** ALT 1 SRCENDP **********************************************
********************************************************************************************/
#define DMAALTCH_SRCENDP0    ((DMASRCENDP_TypeDef*) (DMAALTCH0_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP1    ((DMASRCENDP_TypeDef*) (DMAALTCH1_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP2    ((DMASRCENDP_TypeDef*) (DMAALTCH2_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP3    ((DMASRCENDP_TypeDef*) (DMAALTCH3_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP4    ((DMASRCENDP_TypeDef*) (DMAALTCH4_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP5    ((DMASRCENDP_TypeDef*) (DMAALTCH5_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP6    ((DMASRCENDP_TypeDef*) (DMAALTCH6_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP7    ((DMASRCENDP_TypeDef*) (DMAALTCH7_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP8    ((DMASRCENDP_TypeDef*) (DMAALTCH8_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP9    ((DMASRCENDP_TypeDef*) (DMAALTCH9_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP10    ((DMASRCENDP_TypeDef*) (DMAALTCH10_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP11    ((DMASRCENDP_TypeDef*) (DMAALTCH11_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP12    ((DMASRCENDP_TypeDef*) (DMAALTCH12_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP13    ((DMASRCENDP_TypeDef*) (DMAALTCH13_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP14    ((DMASRCENDP_TypeDef*) (DMAALTCH14_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP15    ((DMASRCENDP_TypeDef*) (DMAALTCH15_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP16    ((DMASRCENDP_TypeDef*) (DMAALTCH16_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP17    ((DMASRCENDP_TypeDef*) (DMAALTCH17_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP18    ((DMASRCENDP_TypeDef*) (DMAALTCH18_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP19    ((DMASRCENDP_TypeDef*) (DMAALTCH19_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP20    ((DMASRCENDP_TypeDef*) (DMAALTCH20_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP21    ((DMASRCENDP_TypeDef*) (DMAALTCH21_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP22    ((DMASRCENDP_TypeDef*) (DMAALTCH22_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP23    ((DMASRCENDP_TypeDef*) (DMAALTCH23_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP24    ((DMASRCENDP_TypeDef*) (DMAALTCH24_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP25    ((DMASRCENDP_TypeDef*) (DMAALTCH25_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP26    ((DMASRCENDP_TypeDef*) (DMAALTCH26_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP27    ((DMASRCENDP_TypeDef*) (DMAALTCH27_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP28    ((DMASRCENDP_TypeDef*) (DMAALTCH28_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP29    ((DMASRCENDP_TypeDef*) (DMAALTCH29_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP30    ((DMASRCENDP_TypeDef*) (DMAALTCH30_BASE + DMAALTCH_SRCENDP_OFFSET))
#define DMAALTCH_SRCENDP31    ((DMASRCENDP_TypeDef*) (DMAALTCH31_BASE + DMAALTCH_SRCENDP_OFFSET))

#define DMAALTCH_SRCENDP0_R    (*((volatile uint32_t*) (DMAALTCH0_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP1_R    (*((volatile uint32_t*) (DMAALTCH1_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP2_R    (*((volatile uint32_t*) (DMAALTCH2_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP3_R    (*((volatile uint32_t*) (DMAALTCH3_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP4_R    (*((volatile uint32_t*) (DMAALTCH4_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP5_R    (*((volatile uint32_t*) (DMAALTCH5_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP6_R    (*((volatile uint32_t*) (DMAALTCH6_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP7_R    (*((volatile uint32_t*) (DMAALTCH7_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP8_R    (*((volatile uint32_t*) (DMAALTCH8_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP9_R    (*((volatile uint32_t*) (DMAALTCH9_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP10_R    (*((volatile uint32_t*) (DMAALTCH10_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP11_R    (*((volatile uint32_t*) (DMAALTCH11_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP12_R    (*((volatile uint32_t*) (DMAALTCH12_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP13_R    (*((volatile uint32_t*) (DMAALTCH13_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP14_R    (*((volatile uint32_t*) (DMAALTCH14_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP15_R    (*((volatile uint32_t*) (DMAALTCH15_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP16_R    (*((volatile uint32_t*) (DMAALTCH16_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP17_R    (*((volatile uint32_t*) (DMAALTCH17_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP18_R    (*((volatile uint32_t*) (DMAALTCH18_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP19_R    (*((volatile uint32_t*) (DMAALTCH19_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP20_R    (*((volatile uint32_t*) (DMAALTCH20_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP21_R    (*((volatile uint32_t*) (DMAALTCH21_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP22_R    (*((volatile uint32_t*) (DMAALTCH22_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP23_R    (*((volatile uint32_t*) (DMAALTCH23_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP24_R    (*((volatile uint32_t*) (DMAALTCH24_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP25_R    (*((volatile uint32_t*) (DMAALTCH25_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP26_R    (*((volatile uint32_t*) (DMAALTCH26_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP27_R    (*((volatile uint32_t*) (DMAALTCH27_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP28_R    (*((volatile uint32_t*) (DMAALTCH28_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP29_R    (*((volatile uint32_t*) (DMAALTCH29_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP30_R    (*((volatile uint32_t*) (DMAALTCH30_BASE + DMAALTCH_SRCENDP_OFFSET)))
#define DMAALTCH_SRCENDP31_R    (*((volatile uint32_t*) (DMAALTCH31_BASE + DMAALTCH_SRCENDP_OFFSET)))

/********************************************************************************************
************************************** 2 DSTENDP **********************************************
********************************************************************************************/
#define DMACH_DSTENDP0    ((DMADSTENDP_TypeDef*) (DMACH0_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP1    ((DMADSTENDP_TypeDef*) (DMACH1_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP2    ((DMADSTENDP_TypeDef*) (DMACH2_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP3    ((DMADSTENDP_TypeDef*) (DMACH3_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP4    ((DMADSTENDP_TypeDef*) (DMACH4_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP5    ((DMADSTENDP_TypeDef*) (DMACH5_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP6    ((DMADSTENDP_TypeDef*) (DMACH6_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP7    ((DMADSTENDP_TypeDef*) (DMACH7_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP8    ((DMADSTENDP_TypeDef*) (DMACH8_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP9    ((DMADSTENDP_TypeDef*) (DMACH9_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP10    ((DMADSTENDP_TypeDef*) (DMACH10_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP11    ((DMADSTENDP_TypeDef*) (DMACH11_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP12    ((DMADSTENDP_TypeDef*) (DMACH12_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP13    ((DMADSTENDP_TypeDef*) (DMACH13_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP14    ((DMADSTENDP_TypeDef*) (DMACH14_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP15    ((DMADSTENDP_TypeDef*) (DMACH15_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP16    ((DMADSTENDP_TypeDef*) (DMACH16_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP17    ((DMADSTENDP_TypeDef*) (DMACH17_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP18    ((DMADSTENDP_TypeDef*) (DMACH18_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP19    ((DMADSTENDP_TypeDef*) (DMACH19_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP20    ((DMADSTENDP_TypeDef*) (DMACH20_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP21    ((DMADSTENDP_TypeDef*) (DMACH21_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP22    ((DMADSTENDP_TypeDef*) (DMACH22_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP23    ((DMADSTENDP_TypeDef*) (DMACH23_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP24    ((DMADSTENDP_TypeDef*) (DMACH24_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP25    ((DMADSTENDP_TypeDef*) (DMACH25_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP26    ((DMADSTENDP_TypeDef*) (DMACH26_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP27    ((DMADSTENDP_TypeDef*) (DMACH27_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP28    ((DMADSTENDP_TypeDef*) (DMACH28_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP29    ((DMADSTENDP_TypeDef*) (DMACH29_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP30    ((DMADSTENDP_TypeDef*) (DMACH30_BASE + DMACH_DSTENDP_OFFSET))
#define DMACH_DSTENDP31    ((DMADSTENDP_TypeDef*) (DMACH31_BASE + DMACH_DSTENDP_OFFSET))

#define DMACH_DSTENDP0_R    (*((volatile uint32_t*) (DMACH0_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP1_R    (*((volatile uint32_t*) (DMACH1_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP2_R    (*((volatile uint32_t*) (DMACH2_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP3_R    (*((volatile uint32_t*) (DMACH3_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP4_R    (*((volatile uint32_t*) (DMACH4_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP5_R    (*((volatile uint32_t*) (DMACH5_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP6_R    (*((volatile uint32_t*) (DMACH6_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP7_R    (*((volatile uint32_t*) (DMACH7_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP8_R    (*((volatile uint32_t*) (DMACH8_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP9_R    (*((volatile uint32_t*) (DMACH9_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP10_R    (*((volatile uint32_t*) (DMACH10_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP11_R    (*((volatile uint32_t*) (DMACH11_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP12_R    (*((volatile uint32_t*) (DMACH12_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP13_R    (*((volatile uint32_t*) (DMACH13_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP14_R    (*((volatile uint32_t*) (DMACH14_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP15_R    (*((volatile uint32_t*) (DMACH15_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP16_R    (*((volatile uint32_t*) (DMACH16_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP17_R    (*((volatile uint32_t*) (DMACH17_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP18_R    (*((volatile uint32_t*) (DMACH18_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP19_R    (*((volatile uint32_t*) (DMACH19_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP20_R    (*((volatile uint32_t*) (DMACH20_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP21_R    (*((volatile uint32_t*) (DMACH21_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP22_R    (*((volatile uint32_t*) (DMACH22_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP23_R    (*((volatile uint32_t*) (DMACH23_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP24_R    (*((volatile uint32_t*) (DMACH24_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP25_R    (*((volatile uint32_t*) (DMACH25_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP26_R    (*((volatile uint32_t*) (DMACH26_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP27_R    (*((volatile uint32_t*) (DMACH27_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP28_R    (*((volatile uint32_t*) (DMACH28_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP29_R    (*((volatile uint32_t*) (DMACH29_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP30_R    (*((volatile uint32_t*) (DMACH30_BASE + DMACH_DSTENDP_OFFSET)))
#define DMACH_DSTENDP31_R    (*((volatile uint32_t*) (DMACH31_BASE + DMACH_DSTENDP_OFFSET)))

/********************************************************************************************
************************************** ALT 2 DSTENDP **********************************************
********************************************************************************************/
#define DMAALTCH_DSTENDP0    ((DMADSTENDP_TypeDef*) (DMAALTCH0_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP1    ((DMADSTENDP_TypeDef*) (DMAALTCH1_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP2    ((DMADSTENDP_TypeDef*) (DMAALTCH2_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP3    ((DMADSTENDP_TypeDef*) (DMAALTCH3_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP4    ((DMADSTENDP_TypeDef*) (DMAALTCH4_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP5    ((DMADSTENDP_TypeDef*) (DMAALTCH5_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP6    ((DMADSTENDP_TypeDef*) (DMAALTCH6_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP7    ((DMADSTENDP_TypeDef*) (DMAALTCH7_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP8    ((DMADSTENDP_TypeDef*) (DMAALTCH8_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP9    ((DMADSTENDP_TypeDef*) (DMAALTCH9_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP10    ((DMADSTENDP_TypeDef*) (DMAALTCH10_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP11    ((DMADSTENDP_TypeDef*) (DMAALTCH11_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP12    ((DMADSTENDP_TypeDef*) (DMAALTCH12_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP13    ((DMADSTENDP_TypeDef*) (DMAALTCH13_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP14    ((DMADSTENDP_TypeDef*) (DMAALTCH14_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP15    ((DMADSTENDP_TypeDef*) (DMAALTCH15_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP16    ((DMADSTENDP_TypeDef*) (DMAALTCH16_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP17    ((DMADSTENDP_TypeDef*) (DMAALTCH17_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP18    ((DMADSTENDP_TypeDef*) (DMAALTCH18_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP19    ((DMADSTENDP_TypeDef*) (DMAALTCH19_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP20    ((DMADSTENDP_TypeDef*) (DMAALTCH20_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP21    ((DMADSTENDP_TypeDef*) (DMAALTCH21_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP22    ((DMADSTENDP_TypeDef*) (DMAALTCH22_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP23    ((DMADSTENDP_TypeDef*) (DMAALTCH23_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP24    ((DMADSTENDP_TypeDef*) (DMAALTCH24_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP25    ((DMADSTENDP_TypeDef*) (DMAALTCH25_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP26    ((DMADSTENDP_TypeDef*) (DMAALTCH26_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP27    ((DMADSTENDP_TypeDef*) (DMAALTCH27_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP28    ((DMADSTENDP_TypeDef*) (DMAALTCH28_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP29    ((DMADSTENDP_TypeDef*) (DMAALTCH29_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP30    ((DMADSTENDP_TypeDef*) (DMAALTCH30_BASE + DMAALTCH_DSTENDP_OFFSET))
#define DMAALTCH_DSTENDP31    ((DMADSTENDP_TypeDef*) (DMAALTCH31_BASE + DMAALTCH_DSTENDP_OFFSET))

