InDeviceMex/TM4C123/TM4C123_ApplicationLib/xDriver_MCU/DMA/Peripheral/Register/xHeader/DMA_RegisterPeripheralChannel.h
#define DMAALTCH_DSTENDP0_R    (*((volatile uint32_t*) (DMAALTCH0_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP1_R    (*((volatile uint32_t*) (DMAALTCH1_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP2_R    (*((volatile uint32_t*) (DMAALTCH2_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP3_R    (*((volatile uint32_t*) (DMAALTCH3_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP4_R    (*((volatile uint32_t*) (DMAALTCH4_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP5_R    (*((volatile uint32_t*) (DMAALTCH5_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP6_R    (*((volatile uint32_t*) (DMAALTCH6_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP7_R    (*((volatile uint32_t*) (DMAALTCH7_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP8_R    (*((volatile uint32_t*) (DMAALTCH8_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP9_R    (*((volatile uint32_t*) (DMAALTCH9_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP10_R    (*((volatile uint32_t*) (DMAALTCH10_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP11_R    (*((volatile uint32_t*) (DMAALTCH11_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP12_R    (*((volatile uint32_t*) (DMAALTCH12_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP13_R    (*((volatile uint32_t*) (DMAALTCH13_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP14_R    (*((volatile uint32_t*) (DMAALTCH14_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP15_R    (*((volatile uint32_t*) (DMAALTCH15_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP16_R    (*((volatile uint32_t*) (DMAALTCH16_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP17_R    (*((volatile uint32_t*) (DMAALTCH17_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP18_R    (*((volatile uint32_t*) (DMAALTCH18_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP19_R    (*((volatile uint32_t*) (DMAALTCH19_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP20_R    (*((volatile uint32_t*) (DMAALTCH20_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP21_R    (*((volatile uint32_t*) (DMAALTCH21_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP22_R    (*((volatile uint32_t*) (DMAALTCH22_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP23_R    (*((volatile uint32_t*) (DMAALTCH23_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP24_R    (*((volatile uint32_t*) (DMAALTCH24_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP25_R    (*((volatile uint32_t*) (DMAALTCH25_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP26_R    (*((volatile uint32_t*) (DMAALTCH26_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP27_R    (*((volatile uint32_t*) (DMAALTCH27_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP28_R    (*((volatile uint32_t*) (DMAALTCH28_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP29_R    (*((volatile uint32_t*) (DMAALTCH29_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP30_R    (*((volatile uint32_t*) (DMAALTCH30_BASE + DMAALTCH_DSTENDP_OFFSET)))
#define DMAALTCH_DSTENDP31_R    (*((volatile uint32_t*) (DMAALTCH31_BASE + DMAALTCH_DSTENDP_OFFSET)))

/********************************************************************************************
************************************** 3 CHCTL **********************************************
********************************************************************************************/
#define DMACH_CHCTL0    ((DMACHCTL_TypeDef*) (DMACH0_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL1    ((DMACHCTL_TypeDef*) (DMACH1_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL2    ((DMACHCTL_TypeDef*) (DMACH2_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL3    ((DMACHCTL_TypeDef*) (DMACH3_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL4    ((DMACHCTL_TypeDef*) (DMACH4_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL5    ((DMACHCTL_TypeDef*) (DMACH5_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL6    ((DMACHCTL_TypeDef*) (DMACH6_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL7    ((DMACHCTL_TypeDef*) (DMACH7_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL8    ((DMACHCTL_TypeDef*) (DMACH8_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL9    ((DMACHCTL_TypeDef*) (DMACH9_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL10    ((DMACHCTL_TypeDef*) (DMACH10_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL11    ((DMACHCTL_TypeDef*) (DMACH11_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL12    ((DMACHCTL_TypeDef*) (DMACH12_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL13    ((DMACHCTL_TypeDef*) (DMACH13_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL14    ((DMACHCTL_TypeDef*) (DMACH14_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL15    ((DMACHCTL_TypeDef*) (DMACH15_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL16    ((DMACHCTL_TypeDef*) (DMACH16_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL17    ((DMACHCTL_TypeDef*) (DMACH17_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL18    ((DMACHCTL_TypeDef*) (DMACH18_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL19    ((DMACHCTL_TypeDef*) (DMACH19_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL20    ((DMACHCTL_TypeDef*) (DMACH20_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL21    ((DMACHCTL_TypeDef*) (DMACH21_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL22    ((DMACHCTL_TypeDef*) (DMACH22_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL23    ((DMACHCTL_TypeDef*) (DMACH23_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL24    ((DMACHCTL_TypeDef*) (DMACH24_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL25    ((DMACHCTL_TypeDef*) (DMACH25_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL26    ((DMACHCTL_TypeDef*) (DMACH26_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL27    ((DMACHCTL_TypeDef*) (DMACH27_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL28    ((DMACHCTL_TypeDef*) (DMACH28_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL29    ((DMACHCTL_TypeDef*) (DMACH29_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL30    ((DMACHCTL_TypeDef*) (DMACH30_BASE + DMACH_CHCTL_OFFSET))
#define DMACH_CHCTL31    ((DMACHCTL_TypeDef*) (DMACH31_BASE + DMACH_CHCTL_OFFSET))

