InDeviceMex/TM4C123/TM4C123_ApplicationLib/xDriver_MCU/DMA/Peripheral/Register/xHeader/DMA_RegisterPeripheralChannel.h
#define DMACH_CHCTL0_R    (*((volatile uint32_t*) (DMACH0_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL1_R    (*((volatile uint32_t*) (DMACH1_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL2_R    (*((volatile uint32_t*) (DMACH2_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL3_R    (*((volatile uint32_t*) (DMACH3_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL4_R    (*((volatile uint32_t*) (DMACH4_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL5_R    (*((volatile uint32_t*) (DMACH5_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL6_R    (*((volatile uint32_t*) (DMACH6_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL7_R    (*((volatile uint32_t*) (DMACH7_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL8_R    (*((volatile uint32_t*) (DMACH8_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL9_R    (*((volatile uint32_t*) (DMACH9_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL10_R    (*((volatile uint32_t*) (DMACH10_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL11_R    (*((volatile uint32_t*) (DMACH11_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL12_R    (*((volatile uint32_t*) (DMACH12_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL13_R    (*((volatile uint32_t*) (DMACH13_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL14_R    (*((volatile uint32_t*) (DMACH14_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL15_R    (*((volatile uint32_t*) (DMACH15_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL16_R    (*((volatile uint32_t*) (DMACH16_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL17_R    (*((volatile uint32_t*) (DMACH17_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL18_R    (*((volatile uint32_t*) (DMACH18_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL19_R    (*((volatile uint32_t*) (DMACH19_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL20_R    (*((volatile uint32_t*) (DMACH20_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL21_R    (*((volatile uint32_t*) (DMACH21_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL22_R    (*((volatile uint32_t*) (DMACH22_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL23_R    (*((volatile uint32_t*) (DMACH23_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL24_R    (*((volatile uint32_t*) (DMACH24_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL25_R    (*((volatile uint32_t*) (DMACH25_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL26_R    (*((volatile uint32_t*) (DMACH26_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL27_R    (*((volatile uint32_t*) (DMACH27_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL28_R    (*((volatile uint32_t*) (DMACH28_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL29_R    (*((volatile uint32_t*) (DMACH29_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL30_R    (*((volatile uint32_t*) (DMACH30_BASE + DMACH_CHCTL_OFFSET)))
#define DMACH_CHCTL31_R    (*((volatile uint32_t*) (DMACH31_BASE + DMACH_CHCTL_OFFSET)))

/********************************************************************************************
************************************** ALT 3 CHCTL **********************************************
********************************************************************************************/
#define DMAALTCH_CHCTL0    ((DMACHCTL_TypeDef*) (DMAALTCH0_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL1    ((DMACHCTL_TypeDef*) (DMAALTCH1_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL2    ((DMACHCTL_TypeDef*) (DMAALTCH2_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL3    ((DMACHCTL_TypeDef*) (DMAALTCH3_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL4    ((DMACHCTL_TypeDef*) (DMAALTCH4_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL5    ((DMACHCTL_TypeDef*) (DMAALTCH5_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL6    ((DMACHCTL_TypeDef*) (DMAALTCH6_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL7    ((DMACHCTL_TypeDef*) (DMAALTCH7_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL8    ((DMACHCTL_TypeDef*) (DMAALTCH8_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL9    ((DMACHCTL_TypeDef*) (DMAALTCH9_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL10    ((DMACHCTL_TypeDef*) (DMAALTCH10_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL11    ((DMACHCTL_TypeDef*) (DMAALTCH11_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL12    ((DMACHCTL_TypeDef*) (DMAALTCH12_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL13    ((DMACHCTL_TypeDef*) (DMAALTCH13_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL14    ((DMACHCTL_TypeDef*) (DMAALTCH14_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL15    ((DMACHCTL_TypeDef*) (DMAALTCH15_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL16    ((DMACHCTL_TypeDef*) (DMAALTCH16_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL17    ((DMACHCTL_TypeDef*) (DMAALTCH17_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL18    ((DMACHCTL_TypeDef*) (DMAALTCH18_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL19    ((DMACHCTL_TypeDef*) (DMAALTCH19_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL20    ((DMACHCTL_TypeDef*) (DMAALTCH20_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL21    ((DMACHCTL_TypeDef*) (DMAALTCH21_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL22    ((DMACHCTL_TypeDef*) (DMAALTCH22_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL23    ((DMACHCTL_TypeDef*) (DMAALTCH23_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL24    ((DMACHCTL_TypeDef*) (DMAALTCH24_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL25    ((DMACHCTL_TypeDef*) (DMAALTCH25_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL26    ((DMACHCTL_TypeDef*) (DMAALTCH26_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL27    ((DMACHCTL_TypeDef*) (DMAALTCH27_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL28    ((DMACHCTL_TypeDef*) (DMAALTCH28_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL29    ((DMACHCTL_TypeDef*) (DMAALTCH29_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL30    ((DMACHCTL_TypeDef*) (DMAALTCH30_BASE + DMAALTCH_CHCTL_OFFSET))
#define DMAALTCH_CHCTL31    ((DMACHCTL_TypeDef*) (DMAALTCH31_BASE + DMAALTCH_CHCTL_OFFSET))

#define DMAALTCH_CHCTL0_R    (*((volatile uint32_t*) (DMAALTCH0_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL1_R    (*((volatile uint32_t*) (DMAALTCH1_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL2_R    (*((volatile uint32_t*) (DMAALTCH2_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL3_R    (*((volatile uint32_t*) (DMAALTCH3_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL4_R    (*((volatile uint32_t*) (DMAALTCH4_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL5_R    (*((volatile uint32_t*) (DMAALTCH5_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL6_R    (*((volatile uint32_t*) (DMAALTCH6_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL7_R    (*((volatile uint32_t*) (DMAALTCH7_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL8_R    (*((volatile uint32_t*) (DMAALTCH8_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL9_R    (*((volatile uint32_t*) (DMAALTCH9_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL10_R    (*((volatile uint32_t*) (DMAALTCH10_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL11_R    (*((volatile uint32_t*) (DMAALTCH11_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL12_R    (*((volatile uint32_t*) (DMAALTCH12_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL13_R    (*((volatile uint32_t*) (DMAALTCH13_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL14_R    (*((volatile uint32_t*) (DMAALTCH14_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL15_R    (*((volatile uint32_t*) (DMAALTCH15_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL16_R    (*((volatile uint32_t*) (DMAALTCH16_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL17_R    (*((volatile uint32_t*) (DMAALTCH17_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL18_R    (*((volatile uint32_t*) (DMAALTCH18_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL19_R    (*((volatile uint32_t*) (DMAALTCH19_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL20_R    (*((volatile uint32_t*) (DMAALTCH20_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL21_R    (*((volatile uint32_t*) (DMAALTCH21_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL22_R    (*((volatile uint32_t*) (DMAALTCH22_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL23_R    (*((volatile uint32_t*) (DMAALTCH23_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL24_R    (*((volatile uint32_t*) (DMAALTCH24_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL25_R    (*((volatile uint32_t*) (DMAALTCH25_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL26_R    (*((volatile uint32_t*) (DMAALTCH26_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL27_R    (*((volatile uint32_t*) (DMAALTCH27_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL28_R    (*((volatile uint32_t*) (DMAALTCH28_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL29_R    (*((volatile uint32_t*) (DMAALTCH29_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL30_R    (*((volatile uint32_t*) (DMAALTCH30_BASE + DMAALTCH_CHCTL_OFFSET)))
#define DMAALTCH_CHCTL31_R    (*((volatile uint32_t*) (DMAALTCH31_BASE + DMAALTCH_CHCTL_OFFSET)))

#endif /* XDRIVER_MCU_DRIVER_HEADER_DMA_DMA_PERIPHERAL_DMA_REGISTER_DMA_REGISTERPERIPHERALCHANNEL_H_ */
